shellxml/GetCustomerSalesTransaction.txt

<?xml version="1.0" encoding="utf-8" ?>
		<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
			<soap:Body>
				<GetCustomerSalesTransaction xmlns="https://tts.turkiyeshell.com">
					<cust_code>{customercode}</cust_code>
					<user_id>{userid}</user_id>
					<password>{password}</password>
					<branch_code>{branchcode}</branch_code>
					<report_start_dt>{bgndate}T03:00:00</report_start_dt>
					<report_end_dt>{enddate}T03:00:00</report_end_dt>
					<plate_code>{plate}</plate_code>
					<department_code>{department}</department_code>
					<invoice_number>{invoice}</invoice_number>
					<customer_reference>{reference}</customer_reference>
				</GetCustomerSalesTransaction>
			</soap:Body>
		</soap:Envelope>